[Killed] ArrowFunction
src/components/InfoBox/index.jsx:10:38
   const { name, ranking, score } = props
   
   const formattedName = name 
-    ? [name.first, name.last].filter((namePart) => !!namePart).join(' ')
+    ? [name.first, name.last].filter(() => undefined).join(' ')
     : UNKNOWN
 

[Killed] BooleanLiteral
src/components/InfoBox/index.jsx:10:52
   const { name, ranking, score } = props
   
   const formattedName = name 
-    ? [name.first, name.last].filter((namePart) => !!namePart).join(' ')
+    ? [name.first, name.last].filter((namePart) => !namePart).join(' ')
     : UNKNOWN
 

[Killed] BlockStatement
src/components/InfoBox/index.jsx:13:36
     ? [name.first, name.last].filter((namePart) => !!namePart).join(' ')
     : UNKNOWN
 
-  const formattedRank = ((rank) => {
-    if(rank === 1) return '1st'
-    if(rank === 2) return '2nd'
-    if(rank === 3) return '3rd'
-    if(rank > 10) return '> 10th'
-    if(!rank) return UNKNOWN
-    return `${rank}th`
-  })(ranking)
+  const formattedRank = ((rank) => {})(ranking)
   
   const formattedScore = score || UNKNOWN

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:14:8
     : UNKNOWN
 
   const formattedRank = ((rank) => {
-    if(rank === 1) return '1st'
+    if(false) return '1st'
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:14:8
     : UNKNOWN
 
   const formattedRank = ((rank) => {
-    if(rank === 1) return '1st'
+    if(true) return '1st'
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'

[Killed] EqualityOperator
src/components/InfoBox/index.jsx:15:8
 
   const formattedRank = ((rank) => {
     if(rank === 1) return '1st'
-    if(rank === 2) return '2nd'
+    if(rank !== 2) return '2nd'
     if(rank === 3) return '3rd'
     if(rank > 10) return '> 10th'

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:15:8
 
   const formattedRank = ((rank) => {
     if(rank === 1) return '1st'
-    if(rank === 2) return '2nd'
+    if(false) return '2nd'
     if(rank === 3) return '3rd'
     if(rank > 10) return '> 10th'

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:16:8
   const formattedRank = ((rank) => {
     if(rank === 1) return '1st'
     if(rank === 2) return '2nd'
-    if(rank === 3) return '3rd'
+    if(true) return '3rd'
     if(rank > 10) return '> 10th'
     if(!rank) return UNKNOWN

[Killed] EqualityOperator
src/components/InfoBox/index.jsx:16:8
   const formattedRank = ((rank) => {
     if(rank === 1) return '1st'
     if(rank === 2) return '2nd'
-    if(rank === 3) return '3rd'
+    if(rank !== 3) return '3rd'
     if(rank > 10) return '> 10th'
     if(!rank) return UNKNOWN

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:17:8
     if(rank === 1) return '1st'
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'
-    if(rank > 10) return '> 10th'
+    if(true) return '> 10th'
     if(!rank) return UNKNOWN
     return `${rank}th`

[Killed] EqualityOperator
src/components/InfoBox/index.jsx:17:8
     if(rank === 1) return '1st'
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'
-    if(rank > 10) return '> 10th'
+    if(rank >= 10) return '> 10th'
     if(!rank) return UNKNOWN
     return `${rank}th`

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:18:8
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'
     if(rank > 10) return '> 10th'
-    if(!rank) return UNKNOWN
+    if(true) return UNKNOWN
     return `${rank}th`
   })(ranking)

[Killed] BooleanLiteral
src/components/InfoBox/index.jsx:18:8
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'
     if(rank > 10) return '> 10th'
-    if(!rank) return UNKNOWN
+    if(rank) return UNKNOWN
     return `${rank}th`
   })(ranking)

[Killed] StringLiteral
src/components/InfoBox/index.jsx:19:12
     if(rank === 3) return '3rd'
     if(rank > 10) return '> 10th'
     if(!rank) return UNKNOWN
-    return `${rank}th`
+    return ``
   })(ranking)
   

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:22:26
     return `${rank}th`
   })(ranking)
   
-  const formattedScore = score || UNKNOWN
+  const formattedScore = true
 
   return (

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:22:26
     return `${rank}th`
   })(ranking)
   
-  const formattedScore = score || UNKNOWN
+  const formattedScore = false
 
   return (

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:26:12
 
   return (
     <ul className="InfoBox">
-      <li>{formattedName || UNKNOWN}</li>
+      <li>{false}</li>
       <li>Rank: {formattedRank}</li>
       <li>Score: {formattedScore}</li>

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:26:12
 
   return (
     <ul className="InfoBox">
-      <li>{formattedName || UNKNOWN}</li>
+      <li>{true}</li>
       <li>Rank: {formattedRank}</li>
       <li>Score: {formattedScore}</li>
