[Killed] BlockStatement
src/components/UserDetails/index.jsx:5:39
 
 import './index.css'
 
-export const UserDetails = (props) => {
-  const { firstName, lastName, email, jsBeatsTs } = props
-  return (
-    <div>
-      <ul className="userDetails">
-        <li><b>First Name:</b> {firstName}</li>
-        <li><b>Last Name:</b> {lastName}</li>
-        <li><b>Email:</b> {email}</li>
-        <li><b>Admits JS &gt; TS?</b> { jsBeatsTs >= 100 ? 'Obviously' : 'No, they must be in denial'}</li>
-      </ul>
-    </div>
-  )
-}
+export const UserDetails = (props) => {}
 

[Survived] EqualityOperator
src/components/UserDetails/index.jsx:13:41
         <li><b>First Name:</b> {firstName}</li>
         <li><b>Last Name:</b> {lastName}</li>
         <li><b>Email:</b> {email}</li>
-        <li><b>Admits JS &gt; TS?</b> { jsBeatsTs >= 100 ? 'Obviously' : 'No, they must be in denial'}</li>
+        <li><b>Admits JS &gt; TS?</b> { jsBeatsTs > 100 ? 'Obviously' : 'No, they must be in denial'}</li>
       </ul>
     </div>

[Survived] EqualityOperator
src/components/UserDetails/index.jsx:13:41
         <li><b>First Name:</b> {firstName}</li>
         <li><b>Last Name:</b> {lastName}</li>
         <li><b>Email:</b> {email}</li>
-        <li><b>Admits JS &gt; TS?</b> { jsBeatsTs >= 100 ? 'Obviously' : 'No, they must be in denial'}</li>
+        <li><b>Admits JS &gt; TS?</b> { jsBeatsTs < 100 ? 'Obviously' : 'No, they must be in denial'}</li>
       </ul>
     </div>
