[Killed] BooleanLiteral
src/components/UserDetailsForm/index.jsx:21:23
           id="firstName"
           name="firstName"
           ref={register({
-            required: true,
+            required: false,
             minLength: 2,
             maxLength: 15

[Killed] StringLiteral
src/components/UserDetailsForm/index.jsx:53:24
             required: true,
             pattern: {
               value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
-              message: 'Please enter a valid email address'
+              message: ""
             }
           })}
