[Survived] BlockStatement
src/components/UserDetailsPage/index.jsx:17:53
   const [userDetails, setUserDetails] = React.useState({})
   const [pageError, setPageError] = React.useState('')
 
-  const saveUserSubmitHandler = async (formData) => {
-    await saveUserDetails(formData)
-  }
+  const saveUserSubmitHandler = async (formData) => {}
 
 

[Survived] BlockStatement
src/components/UserDetailsPage/index.jsx:22:40
   }
 
 
-  const fetchUserDetails = async () => {
-    try {
-      setUserDetails(await getUserDetails(userId))
-    } catch(err) {
-      setPageError('Error fetching user details')
-    }
-  }
+  const fetchUserDetails = async () => {}
   useEffect(() => fetchUserDetails(), [])
 

[Survived] BlockStatement
src/components/UserDetailsPage/index.jsx:23:9
 
 
   const fetchUserDetails = async () => {
-    try {
-      setUserDetails(await getUserDetails(userId))
-    } catch(err) {
+    try {} catch(err) {
       setPageError('Error fetching user details')
     }

[Survived] BlockStatement
src/components/UserDetailsPage/index.jsx:25:18
   const fetchUserDetails = async () => {
     try {
       setUserDetails(await getUserDetails(userId))
-    } catch(err) {
-      setPageError('Error fetching user details')
-    }
+    } catch(err) {}
   }
   useEffect(() => fetchUserDetails(), [])

[Survived] StringLiteral
src/components/UserDetailsPage/index.jsx:26:20
     try {
       setUserDetails(await getUserDetails(userId))
     } catch(err) {
-      setPageError('Error fetching user details')
+      setPageError("")
     }
   }

[Survived] ArrowFunction
src/components/UserDetailsPage/index.jsx:29:13
       setPageError('Error fetching user details')
     }
   }
-  useEffect(() => fetchUserDetails(), [])
+  useEffect(() => undefined, [])
 
   return (

[Survived] LogicalOperator
src/components/UserDetailsPage/index.jsx:57:8
         : <UserDetails {...userDetails} />
       }
 
-      {pageError && <p>{pageError}</p>}
+      {pageError || <p>{pageError}</p>}
 
     </div>

[Survived] ConditionalExpression
src/components/UserDetailsPage/index.jsx:57:8
         : <UserDetails {...userDetails} />
       }
 
-      {pageError && <p>{pageError}</p>}
+      {false}
 
     </div>
