[Killed] BlockStatement
src/components/UserLoginPage/index.jsx:15:58
   const { register, watch } = useForm()
   const isNewUser = watch('newUser')
 
-  const createNewUserSubmitHandler = async (formData) => {
-    await saveUserDetails(formData)
-    props.history.push('/home')
-  }
+  const createNewUserSubmitHandler = async (formData) => {}
 
   const loginSubmitHandler = async (formData) => {

[Killed] BlockStatement
src/components/UserLoginPage/index.jsx:20:50
     props.history.push('/home')
   }
 
-  const loginSubmitHandler = async (formData) => {
-    await login(formData);
-    if(getUserToken()) {
-
-      props.history.push('/home')
-    }
-  }
+  const loginSubmitHandler = async (formData) => {}
 
   return (

[Killed] BlockStatement
src/components/UserLoginPage/index.jsx:22:24
 
   const loginSubmitHandler = async (formData) => {
     await login(formData);
-    if(getUserToken()) {
-
-      props.history.push('/home')
-    }
+    if(getUserToken()) {}
   }
 

[Killed] ConditionalExpression
src/components/UserLoginPage/index.jsx:22:8
 
   const loginSubmitHandler = async (formData) => {
     await login(formData);
-    if(getUserToken()) {
+    if(true) {
 
       props.history.push('/home')
