[Killed] ArrowFunction
src/services/Auth/index.jsx:7:29
 
 export let userToken = {}
 
-export const getUserToken = () => userToken.token
+export const getUserToken = () => undefined
 
 

[Killed] BlockStatement
src/services/Auth/index.jsx:11:53
 
 
 // Pseudo mercury-mobx store with side-effects to store state after making a request
-export const login = async ({ email, password }) => {
-  const { data } = await axios({
-    url: userDetailsEndpoint,
-    method: 'POST',
-    data: { email, password },
-    headers: {
-      'Content-Type': 'application/json'
-    }
-  })
-  userToken = data
-
-}
+export const login = async ({ email, password }) => {}

[Killed] ObjectLiteral
src/services/Auth/index.jsx:15:11
   const { data } = await axios({
     url: userDetailsEndpoint,
     method: 'POST',
-    data: { email, password },
+    data: {},
     headers: {
       'Content-Type': 'application/json'
