[Killed] BlockStatement
src/services/UserData/index.jsx:5:49
 
 const userDetailsEndpoint = 'https://fake-url.fake/userDetails'
 
-export const saveUserDetails = (userDetails) => {
-  return axios({
-    url: userDetailsEndpoint,
-    method: 'POST',
-    data: userDetails,
-    headers: {
-      'Content-Type': 'application/json'
-    }
-  })
-}
+export const saveUserDetails = (userDetails) => {}
 
 export const getUserDetails = (userId) => {

[Killed] ObjectLiteral
src/services/UserData/index.jsx:6:16
 const userDetailsEndpoint = 'https://fake-url.fake/userDetails'
 
 export const saveUserDetails = (userDetails) => {
-  return axios({
-    url: userDetailsEndpoint,
-    method: 'POST',
-    data: userDetails,
-    headers: {
-      'Content-Type': 'application/json'
-    }
-  })
+  return axios({})
 }
 

[Killed] BlockStatement
src/services/UserData/index.jsx:16:43
   })
 }
 
-export const getUserDetails = (userId) => {
-  return axios({
-    url: `${userDetailsEndpoint}/${userId}`,
-    method: 'GET',
-  })
-}
+export const getUserDetails = (userId) => {}
 
 

[Killed] StringLiteral
src/services/UserData/index.jsx:18:10
 
 export const getUserDetails = (userId) => {
   return axios({
-    url: `${userDetailsEndpoint}/${userId}`,
+    url: ``,
     method: 'GET',
   })
