[Killed] BlockStatement
src/components/InfoBox/index.jsx:11:36
     ? [name.first, name.last].filter((namePart) => !!namePart).join(' ')
     : 'Unknown'
 
-  const formattedRank = ((rank) => {
-    if(rank === 1) return '1st'
-    if(rank === 2) return '2nd'
-    if(rank === 3) return '3rd'
-    if(rank > 10) return '> 10th'
-    if(!rank) return 'Unknown'
-    return `${rank}th`
-  })(ranking)
+  const formattedRank = ((rank) => {})(ranking)
   
   const formattedScore = score || 'Unknown'

[Killed] EqualityOperator
src/components/InfoBox/index.jsx:12:8
     : 'Unknown'
 
   const formattedRank = ((rank) => {
-    if(rank === 1) return '1st'
+    if(rank !== 1) return '1st'
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:14:8
   const formattedRank = ((rank) => {
     if(rank === 1) return '1st'
     if(rank === 2) return '2nd'
-    if(rank === 3) return '3rd'
+    if(false) return '3rd'
     if(rank > 10) return '> 10th'
     if(!rank) return 'Unknown'

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:15:8
     if(rank === 1) return '1st'
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'
-    if(rank > 10) return '> 10th'
+    if(false) return '> 10th'
     if(!rank) return 'Unknown'
     return `${rank}th`

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:16:8
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'
     if(rank > 10) return '> 10th'
-    if(!rank) return 'Unknown'
+    if(true) return 'Unknown'
     return `${rank}th`
   })(ranking)

[Killed] BooleanLiteral
src/components/InfoBox/index.jsx:16:8
     if(rank === 2) return '2nd'
     if(rank === 3) return '3rd'
     if(rank > 10) return '> 10th'
-    if(!rank) return 'Unknown'
+    if(rank) return 'Unknown'
     return `${rank}th`
   })(ranking)

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:20:26
     return `${rank}th`
   })(ranking)
   
-  const formattedScore = score || 'Unknown'
+  const formattedScore = false
 
   return (

[Killed] LogicalOperator
src/components/InfoBox/index.jsx:20:26
     return `${rank}th`
   })(ranking)
   
-  const formattedScore = score || 'Unknown'
+  const formattedScore = score && 'Unknown'
 
   return (

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:24:12
 
   return (
     <ul className="InfoBox">
-      <li>{formattedName || 'Unknown'}</li>
+      <li>{true}</li>
       <li>Rank: {formattedRank}</li>
       <li>Score: {formattedScore}</li>

[Killed] ConditionalExpression
src/components/InfoBox/index.jsx:24:12
 
   return (
     <ul className="InfoBox">
-      <li>{formattedName || 'Unknown'}</li>
+      <li>{false}</li>
       <li>Rank: {formattedRank}</li>
       <li>Score: {formattedScore}</li>
