[Killed] ObjectLiteral
src/components/UserLoginForm/index.jsx:21:22
           name="email"
           ref={register({
             required: true,
-            pattern: {
-              value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
-              message: "invalid email address"
-            }
+            pattern: {}
           })}
         />

[Survived] StringLiteral
src/components/UserLoginForm/index.jsx:23:24
             required: true,
             pattern: {
               value: /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
-              message: "invalid email address"
+              message: ""
             }
           })}
