[Killed] BlockStatement
src/services/Auth/index.jsx:9:53
 
 export const getUserToken = () => userToken.token
 
-export const login = async ({ email, password }) => {
-  const { data } = await axios({
-    url: userDetailsEndpoint,
-    method: 'POST',
-    data: { email, password },
-    headers: {
-      'Content-Type': 'application/json'
-    }
-  })
-  userToken = data
-
-}
+export const login = async ({ email, password }) => {}

[Killed] ObjectLiteral
src/services/Auth/index.jsx:10:32
 export const getUserToken = () => userToken.token
 
 export const login = async ({ email, password }) => {
-  const { data } = await axios({
-    url: userDetailsEndpoint,
-    method: 'POST',
-    data: { email, password },
-    headers: {
-      'Content-Type': 'application/json'
-    }
-  })
+  const { data } = await axios({})
   userToken = data
 

[Killed] ObjectLiteral
src/services/Auth/index.jsx:14:14
     url: userDetailsEndpoint,
     method: 'POST',
     data: { email, password },
-    headers: {
-      'Content-Type': 'application/json'
-    }
+    headers: {}
   })
   userToken = data

[Killed] StringLiteral
src/services/Auth/index.jsx:15:23
     method: 'POST',
     data: { email, password },
     headers: {
-      'Content-Type': 'application/json'
+      'Content-Type': ""
     }
   })
